In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
    "Column1" : [1,2,3,4,5,5],
    "Column2" : [100,100,200,300,300,100],
    "Column3" : ["Elcan","Nurlan","Shahmar","Ismayil","Serdar","Ibrahim"]
})

In [3]:
df

   Column1  Column2  Column3
0        1      100    Elcan
1        2      100   Nurlan
2        3      200  Shahmar
3        4      300  Ismayil
4        5      300   Serdar
5        5      100  Ibrahim

In [4]:
df.head(n=5) #default n=5

   Column1  Column2  Column3
0        1      100    Elcan
1        2      100   Nurlan
2        3      200  Shahmar
3        4      300  Ismayil
4        5      300   Serdar

In [5]:
df.head(n=3)

   Column1  Column2  Column3
0        1      100    Elcan
1        2      100   Nurlan
2        3      200  Shahmar

In [7]:
print(df["Column2"].unique())

[100 200 300]

In [8]:
print(df["Column2"].nunique()) #nunique

3

In [9]:
df["Column2"].value_counts()

100    3
300    2
200    1
Name: Column2, dtype: int64

In [10]:
df

   Column1  Column2  Column3
0        1      100    Elcan
1        2      100   Nurlan
2        3      200  Shahmar
3        4      300  Ismayil
4        5      300   Serdar
5        5      100  Ibrahim

In [11]:
df[df["Column1"]>=4]

   Column1  Column2  Column3
3        4      300  Ismayil
4        5      300   Serdar
5        5      100  Ibrahim

In [14]:
df[(df["Column1"]>=4) & (df["Column2"] == 300)]

   Column1  Column2  Column3
3        4      300  Ismayil
4        5      300   Serdar

In [15]:
df

   Column1  Column2  Column3
0        1      100    Elcan
1        2      100   Nurlan
2        3      200  Shahmar
3        4      300  Ismayil
4        5      300   Serdar
5        5      100  Ibrahim

In [16]:
def times3(x):
    return x*3

In [17]:
times3(6)

18

In [22]:
df["Column2"]

0    100
1    100
2    200
3    300
4    300
5    100
Name: Column2, dtype: int64

In [23]:
df["Column2"].apply(times3)

0    300
1    300
2    600
3    900
4    900
5    300
Name: Column2, dtype: int64

In [24]:
df["Column2"] = df["Column2"].apply(times3)

In [25]:
df

   Column1  Column2  Column3
0        1      300    Elcan
1        2      300   Nurlan
2        3      600  Shahmar
3        4      900  Ismayil
4        5      900   Serdar
5        5      300  Ibrahim

In [27]:
square = lambda x:x**2

In [28]:
square(6)

36

In [30]:
df["Column2"].apply(lambda x:x*2) #lambda functions

0     600
1     600
2    1200
3    1800
4    1800
5     600
Name: Column2, dtype: int64

In [31]:
df["Column3"]

0      Elcan
1     Nurlan
2    Shahmar
3    Ismayil
4     Serdar
5    Ibrahim
Name: Column3, dtype: object

In [32]:
df["Column3"].apply(len)

0    5
1    6
2    7
3    7
4    6
5    7
Name: Column3, dtype: int64

In [33]:
df

   Column1  Column2  Column3
0        1      300    Elcan
1        2      300   Nurlan
2        3      600  Shahmar
3        4      900  Ismayil
4        5      900   Serdar
5        5      300  Ibrahim

In [36]:
df.drop("Column3",axis = 1) #inplace = False

   Column1  Column2
0        1      300
1        2      300
2        3      600
3        4      900
4        5      900
5        5      300

In [37]:
df

   Column1  Column2  Column3
0        1      300    Elcan
1        2      300   Nurlan
2        3      600  Shahmar
3        4      900  Ismayil
4        5      900   Serdar
5        5      300  Ibrahim

In [38]:
df.columns

Index(['Column1', 'Column2', 'Column3'], dtype='object')

In [39]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [40]:
len(df.index)

6

In [41]:
df.index.names

FrozenList([None])

In [42]:
df

   Column1  Column2  Column3
0        1      300    Elcan
1        2      300   Nurlan
2        3      600  Shahmar
3        4      900  Ismayil
4        5      900   Serdar
5        5      300  Ibrahim

In [43]:
df.sort_values("Column2") #ascending = True

   Column1  Column2  Column3
0        1      300    Elcan
1        2      300   Nurlan
5        5      300  Ibrahim
2        3      600  Shahmar
3        4      900  Ismayil
4        5      900   Serdar

In [45]:
df.sort_values("Column2",ascending=False) #ascending=False

   Column1  Column2  Column3
3        4      900  Ismayil
4        5      900   Serdar
2        3      600  Shahmar
0        1      300    Elcan
1        2      300   Nurlan
5        5      300  Ibrahim

### Pivot Table

In [57]:
#PIVOT TABLE

In [55]:
df = pd.DataFrame({
    "Ay" : ["Mart","Aprel","May","Mart","Aprel","May","Mart","Aprel","May"],
    "Şəhər" : ["Ağsu","Ağsu","Ağsu","Bakı","Bakı","Bakı","İsmayıllı","İsmayıllı","İsmayıllı"],
    "Nəm" : [10,25,50,21,67,80,30,70,75]
})

In [56]:
df

      Ay      Şəhər  Nəm
0   Mart       Ağsu   10
1  Aprel       Ağsu   25
2    May       Ağsu   50
3   Mart       Bakı   21
4  Aprel       Bakı   67
5    May       Bakı   80
6   Mart  İsmayıllı   30
7  Aprel  İsmayıllı   70
8    May  İsmayıllı   75

In [61]:
df.pivot_table(index = "Ay",columns = "Şəhər",values = "Nəm")

Şəhər  Ağsu  Bakı  İsmayıllı
Ay
Aprel    25    67         70
Mart     10    21         30
May      50    80         75

In [62]:
df.pivot_table(index = "Şəhər",columns = "Ay",values = "Nəm")

Ay         Aprel  Mart  May
Şəhər
Ağsu          25    10   50
Bakı          67    21   80
İsmayıllı     70    30   75